#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ИмяЗначенияМетаданных(ЗначениеПеречисления) Экспорт
	
	ИмяЗначенияПеречисления = "";
	Если ТипЗнч(ЗначениеПеречисления) = Тип("ПеречислениеСсылка.гкс_СостоянияРегистрации") Тогда
		ИндексЗначенияПеречисления = Перечисления.гкс_СостоянияРегистрации.Индекс(ЗначениеПеречисления);
		ИмяЗначенияПеречисления 
				= Метаданные.Перечисления.гкс_СостоянияРегистрации.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	КонецЕсли; 
	
	Возврат ИмяЗначенияПеречисления;
		
КонецФункции
 
#КонецОбласти

#КонецЕсли