#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	УправлениеВидимостьюЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПечать(Команда)
	
	РеквизитыПодписанта 	= ПолучитьРеквизитыПодписанта(Подписант);
	ПодписантНаименование 	= РеквизитыПодписанта.Наименование;
	ПодписантДолжность 		= РеквизитыПодписанта.Должность;
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Подписант", 				ПодписантНаименование);
	ДанныеПечати.Вставить("НомерПломбы", 			НомерПломбы);
	ДанныеПечати.Вставить("ДолжностьПодписанта", 	ПодписантДолжность);
	
	Закрыть(Новый Структура("ДанныеПечати", ДанныеПечати));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостьюЭлементовФормы()
	
	Элементы.НомерПломбы.Видимость =  Параметры.Свойство("ПечатьАктОтбораПроб");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыПодписанта(Подписант)
	
	Возврат гкс_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подписант, "Наименование, Должность");
	
КонецФункции


#КонецОбласти